# СОН — ЭТО ЖИЗНЕННАЯ НЕОБХОДИМОСТЬ. ЗДОРОВЫЙ СОН — НАША ОБЯЗАННОСТЬ ПЕРЕД СОБСТВЕННЫМ ОРГАНИЗМОМ.

a = input('Введите ваше Имя:')
b = int(input('Введите  сколько вы спите:'))
c = int(input('Введите во сколько вы ложитесь спать:'))
d = int(input('Рекоминдованное время для сна 10 - 12 часов вечера:'))

if(b != 7):
    print('У Вас хороший глубокий сон, залог ясного ума и гениальности:')
if(c != 5):
   print('Вы долго спите, это может повлиять на вашу продуктивность:')
elif(d != 12):
    print('Вы позндо ложитесь и долго сидите за компьютором:')
else:
      b != 7, c != 5, d != 12,

#  Легендарный физик Альберт Эйнштейн говорит, что он мог спать по 10–12 часов, считая
#  что полноценный глубокий сон — залог ясного ума и гениальности: